# RebarConstrainedHandle Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarConstrainedHandle Properties
RebarConstrainedHandle Class See Also
---
The RebarConstrainedHandle type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace